import os


def clear_screen():
    os.system("cls" if os.name == "nt" else "clear")


def print_logo():

    logo = r"""
████████╗██████╗ ██╗   ██╗███████╗██╗      ██████╗ ██████╗ ███████╗
╚══██╔══╝██╔══██╗██║   ██║██╔════╝██║     ██╔═══██╗██╔══██╗██╔════╝
   ██║   ██████╔╝██║   ██║█████╗  ██║     ██║   ██║██████╔╝███████╗
   ██║   ██╔══██╗██║   ██║██╔══╝  ██║     ██║   ██║██╔═══╝ ╚════██║
   ██║   ██║  ██║╚██████╔╝██║     ███████╗╚██████╔╝██║     ███████║
   ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚═╝     ╚══════╝ ╚═════╝ ╚═╝     ╚══════╝
"""

    print(logo)


def print_instructions():

    print("TRUFLOPS — TruLaser LST Generator\n")

    print("Instrukcja:")
    print("1. Podaj ścieżkę do pliku DXF")
    print("2. Wybierz materiał:")
    print("   SC - stal czarna")
    print("   SN - stal nierdzewna")
    print("   OC - ocynk")
    print("   AL - aluminium")
    print("3. Podaj grubość blachy")
    print("4. Podaj liczbę detali\n")

    print("--------------------------------------------------\n")


def show_cli():

    clear_screen()
    print_logo()
    print_instructions()